Repository: Hizoka76/HizoSelect
Catalog: */hizoselect.po
Languages: fr

source: The %s argument needs a value.
fr: L'argument %s nécessite une valeur.

source: The number %s is out of selection.
fr: Le nombre %s est hors sélection.

source: %s: %s is not an accepted value.
fr: %s : %s n'est pas une valeur acceptée.

source: %s: %s is not in the proposals list.
fr: %s : %s n'est pas dans la liste des propositions.

source: %s: The number of values is greater than the number of items.
fr: %s : Le nombre de valeur est plus élevé que le nombre de proposition.

source: %s: Impossible to use %s because %s mode is disabled.
fr: %s : Impossible d'utiliser %s car le mode %s est désactivé.

source: %s: Impossible to associate * with another value.
fr: %s : Impossible de coupler * avec une autre valeur.

source: The effects are define by a number between 0 and 255 for effects or by bold dim smul smso.
fr: Les effets sont définis par un nombre entre 0 et 255 pour les couleurs ou par bold dim smul smso.

source: %s: file not founded.
fr: %s : fichier introuvable.

source: The input argument must have %%n.
fr: L'argument input nécessite obligatoirement l'utilisation de %%n.

source: Insufficient number of items.
fr: Nombre de proposition insuffisant.

source: %s key isn't usable.
fr: La touche %s n'est pas utilisable.

source: Maximum limit reached.
fr: Limite maximale atteinte.

source: Number of answer insufficient.
fr: Nombre de réponse insufisant.

source: The --min value cannot be greater than the --max value.
fr: La valeur de --min ne peut être plus grande que celle de --max.

source: %s: - needs a MIN value before and a MAX value after.
fr: %s : - nécessite une valeur MIN avant et une valeur MAX après.

source: The second number must be greater than the first.
fr: Le 2ème nombre doit être plus grand que le 1er.

source: The range needs a second number.
fr: La plage nécessite un 2ème nombre.

source: The range will exceed the maximum answer number.
fr: La plage excédera la limite du nombre de réponse.

source: A number must precede the - sign.
fr: Un nombre doit obligatoirement précéder le signe -.

source: Impossible to add more - signs.
fr: Impossible de cumuler les signes -.

source: This value range will unnecessarily duplicate.
fr: Cette nouvelle plage va faire doublon.

source: The %s argument is unknow.
fr: L'argument %s est inconnu.

source: %s number already entered.
fr: Nombre %s déjà inscrit.

source: Please explain to hizo@free.fr how this error happened.
fr: Merci d'indiquer ce que vous avez fait à hizo@free.fr.

source: %s: A number cannot start by 0.
fr: %s : Un nombre ne peut commencer par 0.

source: Selection:
fr: Sélection :

source: One expected answer
fr: Une réponse attendue

source: Between %s and %s expected answers
fr: Entre %s et %s réponses attendues

source: Minimum of %d expected answer
fr: Minimum d'%d réponse attendue

source: Maximum of %d expected answer
fr: Maximum d'%d réponse attendue

source: Answer
fr: Réponse

source: Help with the use of HizoSelect
fr: Aide à l'utilisation de HizoSelect

source: Number of expected answers:
fr: Nombre de réponses attendues :

source: Possible answers:
fr: Réponses possibles :

source: The numbers select their items.
fr: Les nombres renvoient les valeurs correspondantes.

source: The ? select random items.
fr: Les ? renvoient des valeurs aléatoires.

source: The range select items starts from the first number to the second number included.
fr: Les plages de valeurs renvoient les valeurs entre x et y compris.

source: The * select all items.
fr: Le * renvoie toutes les valeurs

source: Press any key for exiting the help.
fr: Appuyer sur une touche pour quitter l'aide.

source: It's possible to select several times a same item.
fr: Il est possible de sélectionner plusieurs fois une même valeur.

source: Each item can be only select one time.
fr: Chaque proposition ne peut être sélectionnée qu'une seule fois.

source: Effects of actions, commentaries, errors, numbers, prompt text, secret texts, texts and title.
fr: Effets visuels des actions, commentaires, des erreurs, des nombres, du texte du prompt, des textes secrets, des textes et du titre.

source: Enabled actions on start. If the action is visible in the bar, the user can change it.
fr: Actions actives au démarrage. Si l'action est visible dans la barre, l'utilisateur peut la modifier.

source: Hides error messages.
fr: Cache les messages d'erreur.

source: Pre-filled answers.
fr: Réponses pré-rentrées.

source: Demonstration of commands.
fr: Démonstration de commandes.

source: Displays this help.
fr: Affiche cette aide.

source: Mandatory answers.
fr: Réponses obligatoires.

source: Format of the items.
fr: Formatage des propositions.

source: Maximal number of answers.
fr: Nombre maximal de réponse attendue.

source: Minimal number of answers.
fr: Nombre minimal de réponse attendue.

source: Allows to return the same answer several times.
fr: Renvoi plusieurs fois la même réponse possible.

source: Enables the use of symbols in the answers.
fr: Active l'utilisation des symboles dans les réponses.

source: Displayed text between the title and the list of items.
fr: Texte affiché entre le titre et la liste de propositions.

source: Sort the proposals by the choiced argument.
fr: Range les propositions de l'argument choisi.

source: Format of the returned answers.
fr: Formatage des réponses retournées.

source: Displayed text while waiting for the choice.
fr: Texte affiché lors de l'attente de réponse.

source: First displayed text like a title.
fr: Premier texte affiché comme un titre.

source: Delete redundant items by the choiced argument.
fr: Supprime les propositions en doublon de l'argument choisi.

source: Version of the hizoselect command.
fr: Version de la commande hizoselect

source: Examples:
fr: Exemples :

source: More informations:
fr: Plus d'informations :

source: item(s)
fr: proposition(s)

source: int
fr: entier

source: text
fr: texte

source: Management of the content of the bar and its actions.
fr: Gestion du contenu de la barre et de ses actions.

source: Origin of the proposals, command AND/OR stdin.
fr: Origine des propositions, commande ET/OU stdin.

source: Delimiter to use between of the returned items.
fr: Délimiteur à utiliser entre les propositions retournées.

source: Text to add in the help screen.
fr: Texte additionnel à afficher dans l'aide.

source: HizoSelect command help
fr: Aide de la commande HizoSelect

source: Name of the command displayed in error messages.
fr: Nom de la commande affichée dans les messages d'erreurs.

source: Clear the terminal before display the texts.
fr: Nettoie le terminal avant d'afficher les textes.

source: file
fr: fichier

source: Load a config file who contains some values.
fr: Charge un fichier de config contenant divers valeurs.

source: Delimiter between the proposals from stdin
fr: Délimiteur entre les propositions en provenance de stdin.

source: What example(s) do you want see?
fr: Quel(s) exemple(s) veux-tu voir ?

source: %t=Would you marry me? %c=One number by default with a limit to 1 item and output change
fr: %t=Veux-tu m'épouser ? %c=Une valeur par défaut avec un maximum d'une réponse et le format de sorti modifié

source: %t=Choose your menu %c=All by default with a input number for read command
fr: %t=Choisis ton menu %c=Tout (All) par défaut avec un numéro d'input pour la commande read

source: %t=Write the name 'Belleguic' %c=Numbers by default with columns format and several mode enable
fr: %t=Écris le nom 'Belleguic' %c=Nombres par défaut au format colonnes et mode several activé

source: %t=What can be the age of a minor? %c=Range by default with no-all and no-random
fr: %t=Quel peut-être l'âge d'un mineur ? %c=Plage par défaut avec no-all et no-random

source: %t=I remove duplicates for you %c=Uniq item option and prompt text change
fr: %t=Je supprime les doublons pour toi %c=Option de proposition unique et texte du prompt modifié

source: %t=Advanced input/output argument %c=How-to use format
fr: %t=Arguments input/output avancés %c=Comment utiliser le format

source: %t=Traitment of files in a for loop %c=How-to use returns with for loop
fr: %t=Traiter les fichier choisis dans une boucle for %c=Comment utiliser les retours avec une boucle for

source: %t=Use multi read %c=How-to use multi while read loop
fr: %t=Utiliser plusieurs read %c=Comment cumuler les boucles read

source: Command:
fr: Commande :

source: Would you marry me?
fr: Veux-tu m'épouser ?

source: The number %n is %t (%c) and his secret value is %s.
fr: Le nombre %n est %t (%c) et sa valeur secréte est %s.

source: %t=Yes %c=I want it! %s=y
fr: %t=Oui %c=Je le veux! %s=y

source: %t=No %c=Sorry... %s=n
fr: %t=Non %c=Désolé... %s=n

source: I want eat a %t
fr: Je veux manger un %t

source: Choose your menu (All by default):
fr: Choisi ton menu (Tout par défaut) :

source: %t=Entry %c=Vegetables
fr: %t=Entrée %c=Crudités

source: %t=Dish %c=Steak and fries
fr: %t=Plat %c=Steak et frites

source: Write the name 'Belleguic' (Numbers by default)
fr: Écris le nom 'Belleguic' (Nombres par défaut)

source: You write:
fr: Tu écris :

source: What can be the age of a minor?
fr: Quel peut être l'âge d'un mineur ?

source: A minor may be aged: %s years
fr: Un mineur peut être agé de : %s ans

source: I remove duplicates for you:
fr: Je supprime les doublons pour toi :

source: You have choiced: %t
fr: Tu as choisi: %t

source: I wait after you:
fr: J'attends après toi :

source: Advanced input/output argument:
fr: Arguments input/output avancés

source: [%n] (mandatory) <%t and %c and %s (text and commentary and secret text)|%t and %c (text and commentary)|%t and %s (text and secret text)|%c and %s (commentary and secret text)|%t (text)|%c (commentary)|%s (secret text)>
fr: [%n] (obligatoire) <%t et %c et %s (texte et commentaire et texte secret)|%t et %c (texte et commentaire)|%t et %s (texte et texte secret)|%c et %s (commentaire et texte secret)|%t (texte)|%c (commentaire)|%s (texte secret)>

source: \<%n\> (always exists) \| <%t and %c and %s (text and commentary and secret text)|%t and %c (text and commentary)|%t and %s (text and secret text)|%c and %s (commentary and secret text)|%t (text)|%c (commentary)|%s (secret text)>
fr: \<%n\> (existe toujours) \| <%t et %c et %s (texte et commentaire et texte secret)|%t et %c (texte et commentaire)|%t et %s (texte et texte secret )|%c et %s (commentaire et texte secret)|%t (texte)|%c (commentaire)|%s (texte secret)>

source: Select the files to update
fr: Choisir les fichiers à mettre à jour

source: I choosen %s.
fr: J'ai choisi %s.

source: %t=Select software to install %c=Use the secret text
fr: %t=Choisir les logiciels à installer %c=Utilisation du texte secret

source: %t=Select women as you know %c=Create an array indexed
fr: %t=Indiquez les femmes que vous connaissez %c=Création d'un tableau indexé

source: Select software to install
fr: Choisir les logiciels à installer

source: Select women as you know
fr: Indiquez les femmes que vous connaissez

source: h
fr: a

source: Help
fr: Aide

source: c
fr: e

source: Enable effects
fr: Activer effets

source: Disable effects
fr: Désactiver effets

source: v
fr: c

source: View in columns
fr: Voir en colonnes

source: View in lines
fr: Voir en lignes

source: Enable debug
fr: Activer le debogage

source: Disable debug
fr: Désactiver le debogage

source: French translation
fr: Traduction française

source: English translation
fr: Traduction anglaise

source: e
fr: q

source: Exit
fr: Quitter
